Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: If the request-target is not an asterisk, the OPTIONS request applies to the options that are available when communicating with the target resource.
zh_cn: 如果请求目标不是星号，则 OPTIONS 请求将应用于与目标资源通信时可用的选项。

source: If the resource could not be created or modified with the Request-URI, an appropriate error response SHOULD be given that reflects the nature of the problem.
zh_cn: 如果无法使用 Request-URI 创建或修改资源，则应该给出适当的错误响应，以反映问题的性质。

source: If the result of processing a POST would be equivalent to a representation of an existing resource, an origin server MAY redirect the user agent to that resource by sending a 303 (See Other) response with the existing resource's identifier in the Location field.
zh_cn: 如果处理 POST 的结果等同于现有资源的表示，则源服务器可以通过在位置字段中发送具有现有资源标识符的 303(请参阅其他)响应来将用户代理重定向到该资源。

source: If the sender closes the connection or the recipient times out before the indicated number of octets are received, the recipient MUST consider the message to be incomplete and close the connection.
zh_cn: 如果发送方关闭连接或接收方在收到指定的八位字节数之前超时，则接收方必须认为该消息不完整并关闭连接。

source: If the server accepts the PSK, then the security context of the new connection is cryptographically tied to the original connection and the key derived from the initial handshake is used to bootstrap the cryptographic state instead of a full handshake.
zh_cn: 如果服务器接受 PSK，则新连接的安全上下文以加密方式绑定到原始连接，并且从初始握手派生的密钥用于引导加密状态而不是完全握手。

source: If the server cannot produce a certificate chain that is signed only via the indicated supported algorithms, then it SHOULD continue the handshake by sending the client a certificate chain of its choice that may include algorithms that are not known to be supported by the client.
zh_cn: 如果服务器无法生成仅通过指示的支持算法签名的证书链，那么它应该通过向客户端发送其选择的证书链来继续握手，该证书链可能包括客户端不知道的算法。

source: If the server chooses to accept the "early_data" extension, then it MUST comply with the same error-handling requirements specified for all records when processing early data records.
zh_cn: 如果服务器选择接受“early_data”扩展，那么在处理早期数据记录时，它必须遵守为所有记录指定的相同错误处理要求。

source: If the server chooses to close the connection immediately after sending the response, it SHOULD send a Connection header including the connection-token close.
zh_cn: 如果服务器在发送响应后选择立即关闭连接，它应该发送一个包含连接标记关闭的 Connection 首部。

source: If the server desires that the request be applied to a different URI, it MUST send a 301 (Moved Permanently) response; the user agent MAY then make its own decision regarding whether or not to redirect the request.
zh_cn: 如果服务器希望将请求应用于不同的 URI，它必须发送 301(永久移动)响应；然后，用户代理可以自己决定是否重定向请求。

source: If the server does not select a PSK, then the first three of these options are entirely orthogonal: the server independently selects a cipher suite, an (EC)DHE group and key share for key establishment, and a signature algorithm/certificate pair to authenticate itself to the client.
zh_cn: 如果服务器没有选择 PSK，则前三个选项完全正交：服务器独立选择密码套件，(EC)DHE 组和用于密钥建立的密钥共享，以及用于验证的签名算法/证书对本身对客户。

source: If the server does not send an "early_data" extension in EncryptedExtensions, then the client MUST NOT send an EndOfEarlyData message.
zh_cn: 如果服务器没有在 EncryptedExtensions 中发送“early_data”扩展，那么客户端不得发送 EndOfEarlyData 消息。

source: If the server has a group it prefers to the ones in the "key_share" extension but is still willing to accept the ClientHello, it SHOULD send "supported_groups" to update the client's view of its preferences;
zh_cn: 如果服务器有一个组，它更喜欢“key_share”扩展中的组，但仍然愿意接受 ClientHello，它应该发送“supported_groups”来更新客户端对其首选项的看法；

source: If the server has a single certificate, it SHOULD attempt to validate that it meets these criteria.
zh_cn: 如果服务器只有一个证书，它应该尝试验证它是否符合这些标准。

source: If the server has included a non-empty filters list, the client certificate included in the response MUST contain all of the specified extension OIDs that the client recognizes.
zh_cn: 如果服务器包含非空过滤器列表，则响应中包含的客户端证书必须包含客户端识别的所有指定扩展 OID。

source: If the server has multiple certificates, it chooses one of them based on the above-mentioned criteria (in addition to other criteria, such as transport layer endpoint, local configuration and preferences, etc.).
zh_cn: 如果服务器具有多个证书，则它基于上述标准选择其中一个(除了其他标准，例如传输层端点，本地配置和首选项等)。

source: If the server has multiple certificates, it chooses one of them based on the above-mentioned criteria (in addition to other criteria, such as transport-layer endpoint, local configuration, and preferences).
zh_cn: 如果服务器具有多个证书，则会根据上述条件选择其中一个证书(以及其他条件，例如传输层端点，本地配置和首选项)。

source: If the server has sent a CertificateRequest message, the client MUST send the Certificate message.
zh_cn: 如果服务器已发送 CertificateRequest 消息，则客户端必须发送 Certificate 消息。

source: If the server is authenticated, it may request a certificate from the client, if that is appropriate to the cipher suite selected.
zh_cn: 如果服务器已通过身份验证，则可以从客户端请求证书(如果该证书适用于所选的加密套件)。

source: If the server is unable to negotiate a supported set of parameters (i.e., there is no overlap between the client and server parameters), it MUST abort the handshake with either a "handshake_failure" or "insufficient_security" fatal alert (see Section 6).
zh_cn: 如果服务器无法协商一组受支持的参数(即，客户端和服务器参数之间没有重叠)，它必须使用“handshake_failure”或“insufficient_security”致命警报中止握手(参见第 6 节)。

source: If the server receives additional data from the client on a fully closed connection, such as another request that was sent by the client before receiving the server's response, the server's TCP stack will send a reset packet to the client; unfortunately, the reset packet might erase the client's unacknowledged input buffers before they can be read and interpreted by the client's HTTP parser.
zh_cn: 如果服务器在完全关闭的连接上从客户端接收到其他数据，例如客户端在接收服务器响应之前发送的另一个请求，则服务器的 TCP 堆栈将向客户端发送重置数据包；遗憾的是，重置数据包可能会擦除客户端未确认的输入缓冲区，然后客户端的 HTTP 解析器才能读取和解释它们。

source: If the server rejects the "early_data" extension, the client application MAY opt to retransmit the Application Data previously sent in early data once the handshake has been completed.
zh_cn: 如果服务器拒绝“early_data”扩展，则客户端应用程序可以选择在握手完成后重新传输先前在早期数据中发送的应用程序数据。

source: If the server requests client authentication but no suitable certificate is available, the client MUST send a Certificate message containing no certificates (i.e., with the "certificate_list" field having length 0).
zh_cn: 如果服务器请求客户端身份验证但没有合适的证书可用，则客户端必须发送不包含证书的 Certificate 消息(即，“certificate_list”字段的长度为 0)。

source: If the server responds to that request with a non-interim HTTP response message, as described in Section 6 of [RFC7231], then that response is considered an authoritative answer to the client's request.
zh_cn: 如果服务器使用非临时 HTTP 响应消息响应该请求，如 [RFC7231] 的第 6 节中所述，那么该响应被视为客户端请求的权威回复。

source: If the server selects a PSK, then it MUST also select a key establishment mode from the set indicated by the client's "psk_key_exchange_modes" extension (at present, PSK alone or with (EC)DHE).
zh_cn: 如果服务器选择 PSK，那么它还必须从客户端的“psk_key_exchange_modes”扩展指示的集合中选择密钥建立模式(目前，仅 PSK 或 PSK 加 (EC)DHE)。

source: If the server selects an (EC)DHE group and the client did not offer a compatible "key_share" extension in the initial ClientHello, the server MUST respond with a HelloRetryRequest (Section 4.1.4) message.
zh_cn: 如果服务器选择 (EC)DHE 组并且客户端未在初始 ClientHello 中提供兼容的“key_share”扩展，则服务器必须使用 HelloRetryRequest(第 4.1.4 节)消息进行响应。

source: If the server sends a HelloRequest but does not receive a ClientHello in response, it may close the connection with a fatal alert.
zh_cn: 如果服务器发送 HelloRequest 但没有收到 ClientHello 作为响应，它可能会使用致命警报关闭连接。

source: If the server sent an "early_data" extension in EncryptedExtensions, the client MUST send an EndOfEarlyData message after receiving the server Finished.
zh_cn: 如果服务器在 EncryptedExtensions 中发送了“early_data”扩展，则客户端必须在收到服务器完成后发送 EndOfEarlyData 消息。

source: If the server successfully selects parameters and does not require a HelloRetryRequest, it indicates the selected parameters in the ServerHello as follows:
zh_cn: 如果服务器成功选择参数并且不需要 HelloRetryRequest，它将在 ServerHello 中指示所选参数，如下所示：

source: If the server supplies an empty Certificate message, the client MUST abort the handshake with a "decode_error" alert.
zh_cn: 如果服务器提供空的 Certificate 消息，则客户端务必使用“decode_error”警报中止握手。

source: If the server's configuration (or outbound gateway) provides a fixed URI authority component, that authority is used for the effective request URI.
zh_cn: 如果服务器的配置(或出站网关)提供固定的 URI 授权组件，则该授权用于有效的请求 URI。

source: If the server's configuration (or outbound gateway) provides a fixed URI scheme, that scheme is used for the effective request URI.
zh_cn: 如果服务器的配置(或出站网关)提供固定的 URI 方案，则该方案用于有效的请求 URI。

source: If the session_id field is not empty (implying a session resumption request), it MUST include the compression_method from that session.
zh_cn: 如果 session_id 字段不为空(意味着会话恢复请求)，则必须包含该会话的 compression_method。

source: If the session_id field is not empty (implying a session resumption request), this vector MUST include at least the cipher_suite from that session.
zh_cn: 如果 session_id 字段不为空(暗示会话恢复请求)，则该 vector 必须至少包括来自该会话的 cipher_suite。

source: If the source Observable terminates with an error, the PublishSubject will not emit any items to subsequent observers, but will simply pass along the error notification from the source Observable.
zh_cn: 如果源 Observable 以错误终止，则 PublishSubject 将不会向后续观察者发射任何项，但只会传递来自源 Observable 的错误通知。

source: If the target URI includes an authority component, then a client MUST send a field-value for Host that is identical to that authority component, excluding any userinfo subcomponent and its "@" delimiter (Section 2.7.1).
zh_cn: 如果目标 URI 包含授权组件，则客户端必须发送与该授权组件相同的 Host 的字段值，不包括任何 userinfo 子组件及其“@”分隔符(第 2.7.1 节)。

source: If the target URI's path component is empty, the client MUST send "/" as the path within the origin-form of request-target.
zh_cn: 如果目标 URI 的路径组件为空，则客户端必须发送“/”作为 request-target 的 origin-form 中的路径。

source: If the target resource has one or more current representations, they might or might not be destroyed by the origin server, and the associated storage might or might not be reclaimed, depending entirely on the nature of the resource and its implementation by the origin server (which are beyond the scope of this specification).
zh_cn: 如果目标资源具有一个或多个当前表示，它们可能会或可能不会被源服务器销毁，并且相关存储可能会或可能不会被回收，完全取决于资源的性质及其由源服务器的实现(这超出了本规范的范围)。

source: If the user cancels an operation after the handshake is complete, just closing the connection by sending a close_notify is more appropriate.
zh_cn: 如果用户在握手完成后取消操作，则通过发送 close_notify 来关闭连接更为合适。

source: If the verification fails, the receiver MUST terminate the handshake with a "decrypt_error" alert.
zh_cn: 如果验证失败，接收方必须通过“decrypt_error”警报终止握手。

source: If the version number is TLS 1.0 or earlier, server implementations SHOULD check the version number, but MAY have a configuration option to disable the check.
zh_cn: 如果版本号是 TLS 1.0 或更早版本，服务器实现应该检查版本号，但可以有一个配置选项来禁用检查。

source: If there is a conflict between the method semantics and any semantic implied by the URI itself, as described in Section 4.2.1, the method semantics take precedence.
zh_cn: 如果方法语义与 URI 本身隐含的任何语义之间存在冲突，如第 4.2.1 节所述，则方法语义优先。

source: If there is no overlap between the received "supported_groups" and the groups supported by the server, then the server MUST abort the handshake with a "handshake_failure" or an "insufficient_security" alert.
zh_cn: 如果收到的“supported_groups”与服务器支持的组之间没有重叠，则服务器必须通过“handshake_failure”或“insufficient_security”警报中止握手。

source: If this behavior is desirable can be debated, but in any case, if you want to avoid such calls to the uncaught exception handler, the **final application** that uses RxJava 2 (directly or transitively) should set a no-op handler:
zh_cn: 如果这种行为值得商榷，但无论如何，如果您想避免对未捕获的异常处理程序的这种调用，使用 RxJava 2(直接或传递)的 **最终应用程序** 应该设置一个无操作处理程序：

source: If this check fails, the client MUST abort the handshake with an "illegal_parameter" alert.
zh_cn: 如果此检查失败，客户端必须通过“illegal_parameter”警报中止握手。

source: If this extension is not present, servers which are compliant with this specification and which also support TLS 1.2 MUST negotiate TLS 1.2 or prior as specified in [RFC5246], even if ClientHello.legacy_version is 0x0304 or later.
zh_cn: 如果此扩展不存在，那么符合此规范并且也支持 TLS 1.2 的服务器必须按照 [RFC5246] 中的规定协商 TLS 1.2 或更早版本，即使 ClientHello.legacy_version 为 0x0304 或更高版本。

source: If this extension is present in the ClientHello, servers MUST NOT use the ClientHello.legacy_version value for version negotiation and MUST use only the "supported_versions" extension to determine client preferences.
zh_cn: 如果 ClientHello 中存在此扩展，则服务器不得使用 ClientHello.legacy_version 值进行版本协商，并且必须仅使用“supported_versions”扩展来确定客户端首选项。

source: If this extension is present, clients MUST ignore the ServerHello.legacy_version value and MUST use only the "supported_versions" extension to determine the selected version.
zh_cn: 如果存在此扩展，客户端必须忽略 ServerHello.legacy_version 值并且必须仅使用“supported_versions”扩展来确定所选版本。

source: If this form of length is used, then end-of-contents octets (see 8.1.5) shall be present in the encoding following the contents octets.
zh_cn: 如果使用这种形式的长度，则在内容八位字节之后的编码中应存在内容结束八位字节(见 8.1.5)。

source: If this information is itself sensitive, application designers may wish to take steps (padding, cover traffic) to minimize information leakage.
zh_cn: 如果此信息本身是敏感，应用程序设计人员可能希望采取措施(填充，覆盖流量)以最大限度地减少信息泄漏。

source: If this is a request message and none of the above are true, then the message body length is zero (no message body is present).
zh_cn: 如果这是请求消息而且以上都不是真的，那么消息体长度为零(不存在消息体)。

source: If this is a request message, the server MUST respond with a 400 (Bad Request) status code and then close the connection.
zh_cn: 如果这是请求消息，则服务器必须以 400(错误请求)状态代码响应，然后关闭连接。

source: If this is a response message received by a proxy, the proxy MUST close the connection to the server, discard the received response, and send a 502 (Bad Gateway) response to the client.
zh_cn: 如果这是代理收到的响应消息，则代理必须关闭与服务器的连接，丢弃收到的响应，并向客户端发送 502(Bad Gateway)响应。

source: If this is a response message received by a user agent, the user agent MUST close the connection to the server and discard the received response.
zh_cn: 如果这是用户代理收到的响应消息，则用户代理必须关闭与服务器的连接并丢弃收到的响应。

source: If this pattern was not employed before, we encourage updating the code/library in question.
zh_cn: 如果之前没有使用此模式，我们鼓励更新相关代码/库。

source: If two URIs differ only in the case of hexadecimal digits used in percent-encoded octets, they are equivalent.
zh_cn: 如果两个 URI 仅在百分比编码八位字节中使用的十六进制数字的大小写不同，则它们是等效的。

source: If using (EC)DHE key establishment and a HelloRetryRequest containing a "key_share" extension was received by the client, the client MUST verify that the selected NamedGroup in the ServerHello is the same as that in the HelloRetryRequest.
zh_cn: 如果客户端收到 (EC)DHE 密钥建立和包含“key_share”扩展的 HelloRetryRequest，则客户端必须验证 ServerHello 中选定的 NamedGroup 是否与 HelloRetryRequest 中的相同。

source: If using (EC)DHE key establishment, servers offer exactly one KeyShareEntry in the ServerHello.
zh_cn: 如果使用 (EC)DHE 密钥建立，服务器在 ServerHello 中只提供一个 KeyShareEntry。

source: If we'd consume the `iterator` via classic for-loop, that would result in an infinite loop.
zh_cn: 如果我们通过经典的 for 循环使用 `iterator`，那将导致无限循环。

source: If you have a Subject and you want to pass it along to some other agent without exposing its Subscriber interface, you can mask it by calling its asObservable method, which will return the Subject as a pure Observable.
zh_cn: 如果您有一个 Subject 并且想要将其传递给其他代理而不暴露其 Subscriber 接口，则可以通过调用其 asObservable 方法来掩盖它，它将 Subject 作为纯 Observable 返回。

source: If you need to guarantee delivery of all items from the source Observable, you’ll need either to form that Observable with Create so that you can manually reintroduce “cold” Observable behavior (checking to see that all observers have subscribed before beginning to emit items), or switch to using a ReplaySubject instead.
zh_cn: 如果您需要保证从 Observable 源传递所有项目，您需要使用 Create 形成 Observable，以便您可以手动重新引入“冷” Observable 行为(在开始发射项目之前检查所有观察者是否已订阅)，或转而使用 ReplaySubject。

source: If you need to perform cleanup on both regular termination or cancellation, consider the operator `using` instead.
zh_cn: 如果您需要在常规终止或取消时执行清理，请考虑使用操作符 `using`。

source: If you use a ReplaySubject as an observer, take care not to call its onNext method (or its other on methods) from multiple threads, as this could lead to coincident (non-sequential) calls, which violates the Observable contract and creates an ambiguity in the resulting Subject as to which item or notification should be replayed first.
zh_cn: 如果您使用 ReplaySubject 作为观察者，请注意不要从多个线程调用其 onNext 方法(或其他 on 方法)，这可能导致重合(非顺序)调用，这违反了 Observable 协议，并在结果主题中产生了关于应首先重播哪个项目或通知的歧义。

source: If you want to implement your own operator, see Implementing Your Own Operators.
zh_cn: 如果要实现自己的操作符，请参阅 Implementing Your Own Operators。

source: If you want to introduce multithreading into your cascade of Observable operators, you can do so by instructing those operators (or particular Observables) to operate on particular Schedulers.
zh_cn: 如果要将多线程引入到 Observable 操作符链中，可以通过指示这些操作符(或特定的 Observable)在特定的 Schedulers (调度器) 操作来实现。

source: If your code is a library itself (i.e. it is used on the CLASSPATH of users outside your own control), you should not use beta APIs, unless you repackage them (e.g. using ProGuard, shading, etc).
zh_cn: 如果您的代码本身就是一个库(即它在您自己控制之外的用户的 CLASSPATH 上使用)，则不应使用 beta API，除非您重新打包它们(例如使用 ProGuard，shading 等)。

source: If your platform doesn't support Java 8 lambdas (yet), you have to create an inner class of `Consumer` manually:
zh_cn: 如果您的平台(还)不支持 Java 8 lambdas，您必须手动创建一个内部类`Consumer`：

source: Ignore all but the terminal events
zh_cn: 忽略除终端事件之外的所有事件

source: Ignoring such header fields would increase the server's vulnerability to request smuggling attacks (Section 9.5).
zh_cn: 忽略这些首部字段会增加服务器对请求走私攻击的脆弱性(第 9.5 节)。

source: Immediately after sending this message, the sender MUST instruct the record layer to make the write pending state the write active state.
zh_cn: 发送此消息后，发送者必须立即指示记录层将写入挂起状态设置为写入活动状态。

source: Implementation Diversity
zh_cn: 实现多样性

source: Implementation experience and measurements of actual HTTP/1.1 (RFC 2068) implementations show good results [39].
zh_cn: 实际 HTTP/1.1(RFC 2068)实现的实施经验和测量结果显示出良好的结果 [39]。

source: Implementation note: Canvel et al.
zh_cn: 实现说明：Canvel 等。

source: Implementation note: Decompression functions are responsible for ensuring that messages cannot cause internal buffer overflows.
zh_cn: 实现说明：解压缩函数有责任确保消息不会导致内部缓冲区溢出。

source: Implementation note: In HTTP implementations which do not use persistent connections, the server ordinarily expects to be able to signal end of data by closing the connection.
zh_cn: 实现说明：在不使用持久连接的 HTTP 实现中，服务器通常希望能够通过关闭连接来发送数据结束信号。

source: Implementation note: It is now known that remote timing-based attacks on TLS are possible, at least when the client and server are on the same LAN.
zh_cn: 实现说明：现在已知可以对 TLS 进行远程基于时间的攻击，至少在客户端和服务器位于同一 LAN 上时是这样。

source: Implementation note: Public-key-encrypted data is represented as an opaque vector <0..2^16-1> (see Section 4.7).
zh_cn: 实现说明：公钥加密数据表示为 opaque vector <0..2^16-1>(参见第 4.7 节)。

source: Implementation note: The currently defined cipher suite which requires the most material is AES_256_CBC_SHA256.
zh_cn: 实现说明：当前定义的加密套件需要最多的材料是 AES_256_CBC_SHA256。

source: Implementations MUST NOT send extension responses if the remote endpoint did not send the corresponding extension requests, with the exception of the "cookie" extension in the HelloRetryRequest.
zh_cn: 如果远程端点没有发送相应的扩展请求，则实现绝不能发送扩展响应，但 HelloRetryRequest 中的“cookie”扩展除外。

source: Implementations MUST NOT send record types not defined in this document unless negotiated by some extension.
zh_cn: 除非通过某些扩展协商，否则实现绝不能发送本文档中未定义的记录类型。

source: Implementations MUST NOT send zero-length fragments of Handshake types, even if those fragments contain padding.
zh_cn: 实现绝不能发送握手类型的零长度片段，即使这些片段包含填充。

source: Implementations MUST NOT send zero-length fragments of Handshake, Alert, or ChangeCipherSpec content types.
zh_cn: 实现不复发送握手，警报或 ChangeCipherSpec 内容类型的零长度片段。

source: Implementations MUST verify that all messages immediately preceding a key change align with a record boundary; if not, then they MUST terminate the connection with an "unexpected_message" alert.
zh_cn: 实现必须验证密钥更改之前的所有消息是否与记录边界对齐；如果没有，那么他们必须用“unexpected_message”警报终止连接。

source: Implementations SHOULD constantly monitor open connections for a received closure signal and respond to it as appropriate, since prompt closure of both sides of a connection enables allocated system resources to be reclaimed.
zh_cn: 实现应该不断监视接收到的闭包信号的开放连接，并在适当时对其进行响应，因为连接两端的快速关闭可以回收分配的系统资源。

source: Implementations need to be able to parse and ignore unknown values unless the definition of the field states otherwise.
zh_cn: 实现需要能够解析和忽略未知值，除非字段的定义另有说明。

source: Implementations of TLS 1.3 which choose to support prior versions of TLS SHOULD support TLS 1.2.
zh_cn: 选择支持 TLS 早期版本的 TLS 1.3 的实现应该支持 TLS 1.2。

source: Implementations of `request()` in operators ensure proper happens-before relation (or in other terms, memory release or full fence) when necessary.
zh_cn: 操作符中 `request()` 的实现确保在必要时有正确的 happens-before 关系(或在其他术语中，内存释放或完全隔离)。

source: Implementations of this specification MUST send this extension in the ClientHello containing all versions of TLS which they are prepared to negotiate (for this specification, that means minimally 0x0304, but if previous versions of TLS are allowed to be negotiated, they MUST be present as well).
zh_cn: 本规范的实现必须在 ClientHello 中发送此扩展，其中包含它们准备协商的所有 TLS 版本(对于此规范，这意味着最低为 0x0304，但如果允许协商先前版本的 TLS，则它们也必须存在)。

source: Implementations ought to anticipate the need to recover from asynchronous close events.
zh_cn: 实现应该预计需要从异步关闭事件中恢复。

source: Implementations which have the same policy in both cases MAY omit the "signature_algorithms_cert" extension.
zh_cn: 在两种情况下具有相同策略的实现可以省略“signature_algorithms_cert”扩展。

source: Implementors may provide TCP users with the ability to select on a connection by connection basis whether to wait after a crash, or may informally implement the "quite time" for all connections.
zh_cn: 实现者可以为 TCP 用户提供在连接基础上选择是否在崩溃之后等待的能力，或者可以非正式地实现所有连接的“相当时间”。

source: Implementors should be aware of IETF character set requirements [38] [41].
zh_cn: 实现者应该了解 IETF 字符集要求 [38] [41]。

source: Implementors should be aware that some pre-HTTP/1.1 proxies have been known to rewrite the Request-URI.
zh_cn: 实现人员应该知道，已经知道一些 HTTP/1.1 之前的代理会重写请求 URI。

source: Implementors should be aware that the software represents the user in their interactions over the Internet, and should be careful to allow the user to be aware of any actions they might take which may have an unexpected significance to themselves or others.
zh_cn: 实现者应该意识到软件代表用户在互联网上的交互，并且应该小心地让用户知道他们可能采取的任何可能对他们自己或他人有意想不到的意义的行为。

source: Implementors upgrading from SSLv3 MUST modify their implementations to generate and accept the correct encoding.
zh_cn: 从 SSLv3 升级的实现者必须修改其实现以生成并接受正确的编码。

source: Implementors who wish to be compatible with both SSLv3 and TLS should make their implementation's behavior dependent on the protocol version.
zh_cn: 希望与 SSLv3 和 TLS 兼容的实现者应该使其实现的行为依赖于协议版本。

source: Implementors will need to be familiar with the notation in order to understand this specification.
zh_cn: 实现者需要熟悉符号才能理解该规范。

source: In 1.x, the `doOnUnsubscribe` was always executed on a terminal event because 1.x' `SafeSubscriber` called `unsubscribe` on itself.
zh_cn: 在 1.x 中，`doOnUnsubscribe` 总是在终端事件上执行，因为 1.x 的 `SafeSubscriber` 本身调用 `unsubscribe`。

source: In 1.x, you could create an instance with `GroupedObservable.from()` which was used internally by 1.x.
zh_cn: 在 1.x 中，您可以使用 `GroupedObservable.from()` 创建一个实例，该实例由 1.x 内部使用。

source: In 2.0.7, the operator `strict()` returns `this`, is deprecated and will be removed completely in 2.1.0.
zh_cn: 在 2.0.7 中，运算符 `strict()` 返回 `this`，不推荐使用，将在 2.1.0 中完全删除。
